# YOLOv9 gelan-cephalo.yaml

# parameters
nc: 17  # 17 titik landmark
depth_multiple: 1.0
width_multiple: 1.0
anchors: 3

# gelan backbone
backbone:
  [
   [-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 1, RepNCSPELAN4, [256, 128, 64, 1]],  # 2
   [-1, 1, ADown, [256]],  # 3-P3/8
   [-1, 1, RepNCSPELAN4, [512, 256, 128, 1]],  # 4
   [-1, 1, ADown, [512]],  # 5-P4/16
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 6
   [-1, 1, ADown, [512]],  # 7-P5/32
   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 8
  ]

# gelan head with CBAM inserted
head:
  [
   [-1, 1, SPPELAN, [512, 256]],  # 9

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 12

   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [256, 256, 128, 1]],  # 15 (P3/8)

   [-1, 1, ADown, [256]],
   [[-1, 12], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 18 (P4/16)

   [-1, 1, ADown, [512]],
   [[-1, 9], 1, Concat, [1]],

   [-1, 1, RepNCSPELAN4, [512, 512, 256, 1]],  # 21 (P5/32)

   # Tambahkan CBAM sebelum deteksi
   [15, 1, CBAM, [256]],  # CBAM untuk P3
   [18, 1, CBAM, [512]],  # CBAM untuk P4
   [21, 1, CBAM, [512]],  # CBAM untuk P5

   # DDetect final
   [[22, 23, 24], 1, DDetect, [17]],  # DDetect(P3, P4, P5)
  ]
